status/2021/23jul21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-28 Sat 07:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>17 July 2021 - 23 July 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">17 July 2021 - 23 July 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org96f6fd2">1. Santa Cruz Weather Station</a>
<ul>
<li><a href="#orgb18655b">1.1. Next step</a>
<ul>
<li><a href="#orgf8e6e42">1.1.1. Finish Vent/UV mount</a></li>
<li><a href="#orgbf9ee23">1.1.2. Build cable assemblies</a></li>
<li><a href="#org77aff5e">1.1.3. Test in Jig</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5ac164d">2. Soap Molds</a>
<ul>
<li><a href="#org3acdf92">2.1. Next steps</a>
<ul>
<li><a href="#orga6e50ed">2.1.1. Make sure mold doesn't leak.</a></li>
<li><a href="#orgc5c0540">2.1.2. Have Annie try it out.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org97d2ad7">3. Sun Ultra 10</a>
<ul>
<li><a href="#org0b973c1">3.1. Next steps</a>
<ul>
<li><a href="#org5da2a48">3.1.1. Serial debug</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org417c988">4. Apple iMac G4</a>
<ul>
<li><a href="#org1e89488">4.1. Next steps</a>
<ul>
<li><a href="#org6b81010">4.1.1. Obtain userland source</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org88d95c1">5. Criminality Analysis</a></li>
<li><a href="#orgc894f15">6. Marble Run</a></li>
<li><a href="#org6b8e9b8">7. Linux Audio</a>
<ul>
<li><a href="#orgd2bfb55">7.1. pvanal to spectrogram</a>
<ul>
<li><a href="#org9d050f0">7.1.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org2a5f290">7.2. CSound programming.</a>
<ul>
<li><a href="#orga9be056">7.2.1. Next Steps</a></li>
</ul>
</li>
<li><a href="#org1f862e9">7.3. Faust programming</a>
<ul>
<li><a href="#org2a8b256">7.3.1. Next Steps</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5421540">8. EPICS</a>
<ul>
<li><a href="#orgb67451f">8.1. Next steps</a>
<ul>
<li><a href="#orgbcad133">8.1.1. u3scpi network port testing</a></li>
<li><a href="#org62670ed">8.1.2. initial EPICS interface</a></li>
<li><a href="#org3dbe63a">8.1.3. u3scpi analog/digital port reconfiguration.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7577076">9. Brini Tracker II</a>
<ul>
<li><a href="#orgf0f4f6d">9.1. Next steps</a>
<ul>
<li><a href="#orgdf38e61">9.1.1. Validate remaining standard GPS messages</a></li>
<li><a href="#org4ee6741">9.1.2. Investigate GPS chipset data logging</a></li>
<li><a href="#org4544c73">9.1.3. Investigate LoRA radio interface</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgffd8933">10. wktcolor</a>
<ul>
<li><a href="#orgeafa21f">10.1. Next steps</a>
<ul>
<li><a href="#org0ae9342">10.1.1. Explore how to get a minimal coloring</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org842d1e2">11. wktplot</a>
<ul>
<li><a href="#org92c67b2">11.1. Next steps</a></li>
</ul>
</li>
<li><a href="#orgb6de48f">12. AMDGPU</a>
<ul>
<li><a href="#org94ce159">12.1. Next step</a>
<ul>
<li><a href="#org72505a3">12.1.1. Reverse engineer HSAKMT programming.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org61a322a">13. Ninja v Make</a>
<ul>
<li><a href="#orgbc98398">13.1. Next Step</a>
<ul>
<li><a href="#orgac4ac52">13.1.1. clean simple measurements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc2aa10f">14. GMP Forth</a>
<ul>
<li><a href="#org63d9788">14.1. Need to think about adding floating point support</a></li>
<li><a href="#orgd7add81">14.2. Port to non-Linux OS</a></li>
</ul>
</li>
<li><a href="#org4fa3cf9">15. ca-r</a>
<ul>
<li><a href="#org9744f87">15.1. Next Step</a></li>
</ul>
</li>
<li><a href="#org194e804">16. Swocer</a>
<ul>
<li><a href="#orgf91585f">16.1. Most crashing addressed</a></li>
<li><a href="#org6450179">16.2. Added outline for 'bottle' test</a></li>
<li><a href="#org1358ae8">16.3. Next steps</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Broadcom Employees Behaving Badly
</p>

<div id="outline-container-org96f6fd2" class="outline-2">
<h2 id="org96f6fd2"><span class="section-number-2">1.</span> Santa Cruz Weather Station</h2>
<div class="outline-text-2" id="text-1">
<p>
Most Particle Monitor shelter parts fabricated.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Part</th>
<th scope="col" class="org-right">Quan.</th>
<th scope="col" class="org-left">Designed?</th>
<th scope="col" class="org-left">Fabricated?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Vent connector mount</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">Vent connector cover</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">Vent mount</td>
<td class="org-right">2</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM box</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM lid</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM Baffle</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM Screen mount</td>
<td class="org-right">2</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM Screen holder</td>
<td class="org-right">2</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM Inlet shroud</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM box mount</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">Vent/UV mount</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PM Cable assembly</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">(1)</td>
</tr>

<tr>
<td class="org-left">UV Cable assembly</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
(1) Likely will just reuse previous assembly
</p>
</div>

<div id="outline-container-orgb18655b" class="outline-3">
<h3 id="orgb18655b"><span class="section-number-3">1.1.</span> Next step</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgf8e6e42" class="outline-4">
<h4 id="orgf8e6e42"><span class="section-number-4">1.1.1.</span> Finish Vent/UV mount</h4>
</div>
<div id="outline-container-orgbf9ee23" class="outline-4">
<h4 id="orgbf9ee23"><span class="section-number-4">1.1.2.</span> Build cable assemblies</h4>
</div>
<div id="outline-container-org77aff5e" class="outline-4">
<h4 id="org77aff5e"><span class="section-number-4">1.1.3.</span> Test in Jig</h4>
</div>
</div>
</div>

<div id="outline-container-org5ac164d" class="outline-2">
<h2 id="org5ac164d"><span class="section-number-2">2.</span> Soap Molds</h2>
<div class="outline-text-2" id="text-2">
<p>
Printed a shallower top. Still not quite right, but workable.
</p>
</div>
<div id="outline-container-org3acdf92" class="outline-3">
<h3 id="org3acdf92"><span class="section-number-3">2.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orga6e50ed" class="outline-4">
<h4 id="orga6e50ed"><span class="section-number-4">2.1.1.</span> Make sure mold doesn't leak.</h4>
</div>
<div id="outline-container-orgc5c0540" class="outline-4">
<h4 id="orgc5c0540"><span class="section-number-4">2.1.2.</span> Have Annie try it out.</h4>
</div>
</div>
</div>
<div id="outline-container-org97d2ad7" class="outline-2">
<h2 id="org97d2ad7"><span class="section-number-2">3.</span> Sun Ultra 10</h2>
<div class="outline-text-2" id="text-3">
<p>
Trying to see what state it is in. Fires up but no video. Need DB25M to
debug over serial port.
</p>
</div>
<div id="outline-container-org0b973c1" class="outline-3">
<h3 id="org0b973c1"><span class="section-number-3">3.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org5da2a48" class="outline-4">
<h4 id="org5da2a48"><span class="section-number-4">3.1.1.</span> Serial debug</h4>
</div>
</div>
</div>
<div id="outline-container-org417c988" class="outline-2">
<h2 id="org417c988"><span class="section-number-2">4.</span> Apple iMac G4</h2>
<div class="outline-text-2" id="text-4">
<p>
Also trying to see what state it is in. Had Fedora 10 (1) already. Trying
FreeBSD 13, which boots, but pkg/port is not available.
</p>
</div>
<div id="outline-container-org1e89488" class="outline-3">
<h3 id="org1e89488"><span class="section-number-3">4.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org6b81010" class="outline-4">
<h4 id="org6b81010"><span class="section-number-4">4.1.1.</span> Obtain userland source</h4>
</div>
</div>
</div>
<div id="outline-container-org88d95c1" class="outline-2">
<h2 id="org88d95c1"><span class="section-number-2">5.</span> Criminality Analysis</h2>
<div class="outline-text-2" id="text-5">
<p>
An arrest of an apparent Broadcom employee for running a brothel, with one
site across the street from the Innovation Drive campus
</p>

<p>
<a href="https://www.paloaltoonline.com/news/2021/06/18/man-who-allegedly-profited-off-sex-trafficking-more-than-100-women-faces-10-felonies">https://www.paloaltoonline.com/news/2021/06/18/man-who-allegedly-profited-off-sex-trafficking-more-than-100-women-faces-10-felonies</a>
</p>

<p>
has led to a bunch of study and analysis of the general
sex-trafficking problem in the Santa Clara Valley and elsewhere.
</p>

<p>
I have not found the indictment online (it seems I will have to go
to the courthouse for that), so I am somewhat hampered in my
analysis.
</p>
</div>
</div>
<div id="outline-container-orgc894f15" class="outline-2">
<h2 id="orgc894f15"><span class="section-number-2">6.</span> Marble Run</h2>
<div class="outline-text-2" id="text-6">
<p>
Finally built the "Marble Run" wooden rolling ball sculpture. Thinking
about building more. Also: how to do computation with rolling marbles?
</p>
</div>
</div>
<div id="outline-container-org6b8e9b8" class="outline-2">
<h2 id="org6b8e9b8"><span class="section-number-2">7.</span> Linux Audio</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgd2bfb55" class="outline-3">
<h3 id="orgd2bfb55"><span class="section-number-3">7.1.</span> pvanal to spectrogram</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Enough of libriffr and libpvocf work to start pvoctool
<a href="https://github.com/daniel-kelley/pvoctool">https://github.com/daniel-kelley/pvoctool</a>. Have HDF5 output and
text delimited output for octave. Can import PVOC data to octave
spectrogram for display.
</p>
</div>
<div id="outline-container-org9d050f0" class="outline-4">
<h4 id="org9d050f0"><span class="section-number-4">7.1.1.</span> Next steps</h4>
<div class="outline-text-4" id="text-7-1-1">
<p>
Loop analysis
</p>
</div>
</div>
</div>
<div id="outline-container-org2a5f290" class="outline-3">
<h3 id="org2a5f290"><span class="section-number-3">7.2.</span> CSound programming.</h3>
<div class="outline-text-3" id="text-7-2">
<p>
The FORTRAN of computer music. Getting up to speed.
</p>
</div>
<div id="outline-container-orga9be056" class="outline-4">
<h4 id="orga9be056"><span class="section-number-4">7.2.1.</span> Next Steps</h4>
<div class="outline-text-4" id="text-7-2-1">
</div>
<ol class="org-ol">
<li><a id="orgf4ea682"></a>loscil demo<br /></li>
<li><a id="orgbfdeb49"></a>spectrogram loop point analysis<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org1f862e9" class="outline-3">
<h3 id="org1f862e9"><span class="section-number-3">7.3.</span> Faust programming</h3>
<div class="outline-text-3" id="text-7-3">
</div>
<div id="outline-container-org2a8b256" class="outline-4">
<h4 id="org2a8b256"><span class="section-number-4">7.3.1.</span> Next Steps</h4>
<div class="outline-text-4" id="text-7-3-1">
</div>
<ol class="org-ol">
<li><a id="orgd10189c"></a>GAC Patch save/restore<br /></li>
<li><a id="orgb10d7c2"></a>LV2 autopatcher<br />
<div class="outline-text-5" id="text-7-3-1-2">
<p>
Exploratory tool to generate (was pd, ecasound, now carla) patch for arbitrary LV2 plugin:
hook up audio inputs to signal source, audio outputs to speakers, control inputs to
control surface, etc.
</p>
</div>
</li>
<li><a id="orgd0c9f72"></a>OSC control surface<br />
<div class="outline-text-5" id="text-7-3-1-3">
<p>
Some sort of GUI tool (knob/slider) to OSC messages. This may be
as simple as a Faust UI program.
</p>
</div>
</li>
<li><a id="org270ed2a"></a>Faust/csound<br />
<div class="outline-text-5" id="text-7-3-1-4">
<p>
See if a faust generated unit works.
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org5421540" class="outline-2">
<h2 id="org5421540"><span class="section-number-2">8.</span> EPICS</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgb67451f" class="outline-3">
<h3 id="orgb67451f"><span class="section-number-3">8.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-orgbcad133" class="outline-4">
<h4 id="orgbcad133"><span class="section-number-4">8.1.1.</span> u3scpi network port testing</h4>
</div>
<div id="outline-container-org62670ed" class="outline-4">
<h4 id="org62670ed"><span class="section-number-4">8.1.2.</span> initial EPICS interface</h4>
</div>
<div id="outline-container-org3dbe63a" class="outline-4">
<h4 id="org3dbe63a"><span class="section-number-4">8.1.3.</span> u3scpi analog/digital port reconfiguration.</h4>
</div>
</div>
</div>

<div id="outline-container-org7577076" class="outline-2">
<h2 id="org7577076"><span class="section-number-2">9.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-9">
<p>
Suspended for now.
</p>
</div>
<div id="outline-container-orgf0f4f6d" class="outline-3">
<h3 id="orgf0f4f6d"><span class="section-number-3">9.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-orgdf38e61" class="outline-4">
<h4 id="orgdf38e61"><span class="section-number-4">9.1.1.</span> Validate remaining standard GPS messages</h4>
</div>
<div id="outline-container-org4ee6741" class="outline-4">
<h4 id="org4ee6741"><span class="section-number-4">9.1.2.</span> Investigate GPS chipset data logging</h4>
</div>
<div id="outline-container-org4544c73" class="outline-4">
<h4 id="org4544c73"><span class="section-number-4">9.1.3.</span> Investigate LoRA radio interface</h4>
</div>
</div>
</div>

<div id="outline-container-orgffd8933" class="outline-2">
<h2 id="orgffd8933"><span class="section-number-2">10.</span> wktcolor</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orgeafa21f" class="outline-3">
<h3 id="orgeafa21f"><span class="section-number-3">10.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-10-1">
</div>
<div id="outline-container-org0ae9342" class="outline-4">
<h4 id="org0ae9342"><span class="section-number-4">10.1.1.</span> Explore how to get a minimal coloring</h4>
<div class="outline-text-4" id="text-10-1-1">
<p>
Need a specific planar graph four coloring.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org842d1e2" class="outline-2">
<h2 id="org842d1e2"><span class="section-number-2">11.</span> wktplot</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org92c67b2" class="outline-3">
<h3 id="org92c67b2"><span class="section-number-3">11.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-11-1">
<p>
Understand why -r doesn't solve the wktvor/wktdel "sliver at edge" problem.
Explore biological cell Voronoi organization
</p>
</div>
</div>
</div>

<div id="outline-container-orgb6de48f" class="outline-2">
<h2 id="orgb6de48f"><span class="section-number-2">12.</span> AMDGPU</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org94ce159" class="outline-3">
<h3 id="org94ce159"><span class="section-number-3">12.1.</span> Next step</h3>
<div class="outline-text-3" id="text-12-1">
</div>
<div id="outline-container-org72505a3" class="outline-4">
<h4 id="org72505a3"><span class="section-number-4">12.1.1.</span> Reverse engineer HSAKMT programming.</h4>
</div>
</div>
</div>

<div id="outline-container-org61a322a" class="outline-2">
<h2 id="org61a322a"><span class="section-number-2">13.</span> Ninja v Make</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-orgbc98398" class="outline-3">
<h3 id="orgbc98398"><span class="section-number-3">13.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-13-1">
</div>
<div id="outline-container-orgac4ac52" class="outline-4">
<h4 id="orgac4ac52"><span class="section-number-4">13.1.1.</span> clean simple measurements</h4>
</div>
</div>
</div>

<div id="outline-container-orgc2aa10f" class="outline-2">
<h2 id="orgc2aa10f"><span class="section-number-2">14.</span> GMP Forth</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-org63d9788" class="outline-3">
<h3 id="org63d9788"><span class="section-number-3">14.1.</span> Need to think about adding floating point support</h3>
</div>
<div id="outline-container-orgd7add81" class="outline-3">
<h3 id="orgd7add81"><span class="section-number-3">14.2.</span> Port to non-Linux OS</h3>
</div>
</div>
<div id="outline-container-org4fa3cf9" class="outline-2">
<h2 id="org4fa3cf9"><span class="section-number-2">15.</span> ca-r</h2>
<div class="outline-text-2" id="text-15">
<p>
Tier data finally deprecated so processing is removed.
</p>
</div>
<div id="outline-container-org9744f87" class="outline-3">
<h3 id="org9744f87"><span class="section-number-3">15.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-15-1">
<p>
None.
</p>
</div>
</div>
</div>
<div id="outline-container-org194e804" class="outline-2">
<h2 id="org194e804"><span class="section-number-2">16.</span> Swocer</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-orgf91585f" class="outline-3">
<h3 id="orgf91585f"><span class="section-number-3">16.1.</span> Most crashing addressed</h3>
<div class="outline-text-3" id="text-16-1">
<p>
Nullified 'handle' API free functions helped a lot.
Still see some errors in operations.
</p>
</div>
</div>
<div id="outline-container-org6450179" class="outline-3">
<h3 id="org6450179"><span class="section-number-3">16.2.</span> Added outline for 'bottle' test</h3>
<div class="outline-text-3" id="text-16-2">
<p>
Added all functions believed to be needed for 'bottle' demo test.
Test doesn't pass so is disabled.
</p>
</div>
</div>
<div id="outline-container-org1358ae8" class="outline-3">
<h3 id="org1358ae8"><span class="section-number-3">16.3.</span> Next steps</h3>
<div class="outline-text-3" id="text-16-3">
<p>
Swocer future.
Check out what's needed for gears.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-01-28 Sat 07:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
